backend: !!python/unicode 'theano'
class_name: Sequential
config:
- class_name: GaussianNoise
  config:
    batch_input_shape: !!python/tuple [null, 1, 255, 255]
    dtype: float32
    name: gaussian_noise_2
    stddev: 0.01
    trainable: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: &id001 !!python/tuple [1, 1]
    filters: 16
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [5, 5]
    name: conv2d_8
    padding: same
    strides: &id002 !!python/tuple [1, 1]
    trainable: true
    use_bias: true
- class_name: Dropout
  config: {name: dropout_9, rate: 0.5, trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: *id001
    filters: 32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_9
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_first
    name: max_pooling2d_4
    padding: valid
    pool_size: &id003 !!python/tuple [2, 2]
    strides: *id003
    trainable: true
- class_name: Dropout
  config: {name: dropout_10, rate: 0.25, trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: *id001
    filters: 32
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_10
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: *id001
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer:
      class_name: L1L2
      config: {l1: 0.0, l2: 0.009999999776482582}
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_11
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_first
    name: max_pooling2d_5
    padding: valid
    pool_size: &id004 !!python/tuple [2, 2]
    strides: *id004
    trainable: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: *id001
    filters: 64
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer:
      class_name: L1L2
      config: {l1: 0.0, l2: 0.009999999776482582}
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_12
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Dropout
  config: {name: dropout_11, rate: 0.25, trainable: true}
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: *id001
    filters: 128
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer:
      class_name: L1L2
      config: {l1: 0.0, l2: 0.009999999776482582}
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_13
    padding: same
    strides: *id002
    trainable: true
    use_bias: true
- class_name: MaxPooling2D
  config:
    data_format: channels_first
    name: max_pooling2d_6
    padding: valid
    pool_size: &id005 !!python/tuple [2, 2]
    strides: *id005
    trainable: true
- class_name: Conv2D
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    data_format: channels_first
    dilation_rate: *id001
    filters: 128
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer:
      class_name: L1L2
      config: {l1: 0.0, l2: 0.009999999776482582}
    kernel_size: !!python/tuple [3, 3]
    name: conv2d_14
    padding: valid
    strides: *id002
    trainable: true
    use_bias: true
- class_name: Dropout
  config: {name: dropout_12, rate: 0.25, trainable: true}
- class_name: Flatten
  config: {name: flatten_3, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint:
      class_name: MaxNorm
      config: {axis: 0, max_value: 3.0}
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_6
    trainable: true
    units: 128
    use_bias: true
- class_name: Dropout
  config: {name: dropout_13, rate: 0.25, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint:
      class_name: MaxNorm
      config: {axis: 0, max_value: 3.0}
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_7
    trainable: true
    units: 64
    use_bias: true
- class_name: Dropout
  config: {name: dropout_14, rate: 0.25, trainable: true}
- class_name: Dense
  config:
    activation: softmax
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_8
    trainable: true
    units: 2
    use_bias: true
keras_version: 2.0.3
