backend: !!python/unicode 'theano'
class_name: Sequential
config:
- class_name: Flatten
  config:
    batch_input_shape: !!python/tuple [null, 4, 4, 512]
    dtype: float32
    name: flatten_1
    trainable: true
- class_name: Dropout
  config: {name: dropout_1, rate: 0.7, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint:
      class_name: MaxNorm
      config: {axis: 0, max_value: 3.0}
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_1
    trainable: true
    units: 256
    use_bias: true
- class_name: Dropout
  config: {name: dropout_2, rate: 0.5, trainable: true}
- class_name: Dense
  config:
    activation: softmax
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: VarianceScaling
      config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
    kernel_regularizer: null
    name: dense_2
    trainable: true
    units: 2
    use_bias: true
keras_version: 2.0.3
